# 1)Дан лист:
list1 = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]
#   - найти min число в листе
#   - удалить все одинаковые значения
#   - заменить каждое четвертое значение на "Х"
#   - вывести элемент листа, значение которого ближе всего к среднему арифметическому всех элементов этого же листа
# пример:
# [1, 2, 3, 4, 5, 6, 7, 8, 9] => 5
# [-1, -2, 3, 4, 555] => 4
# [5, 5, 5, 5] => 5
# [-10, 5, 5] => 5

###################################
#   - найти min число в листе

# low = list1[0]
# for i in list1:
#     if i < low:
#         low = i
# print(low)
#
# print(min(list1))

###################################
#   - удалить все одинаковые значения
# list2 = []
# for i in list1:
#     if i not in list2:
#         list2.append(i)
# print(list2)
###################################
#   - заменить каждое четвертое значение на "Х"

# list1 = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]
# index = 0
# for i in list1:
#     print(list1[index], index)
#     list1.pop(index)
#     list1.insert(index, 'X')
#     if index + 4 < len(list1)-1:
#         index += 4
#     else:
#         break
# print(list1)

# # ['X', 3, 5, 2, 'X', 2, -23, 8, 'X', 5]

###################################
#   - вывести элемент листа, значение которого ближе всего к среднему арифметическому всех элементов этого же листа

# avg = sum(list1) / len(list1)
# dif = max(list1)
# elem = 0
#
# for i in list1:
#     if abs(i - avg) < dif:
#         dif = abs(i - avg)
#         elem = i
# print("Число = ", elem, "\nРізниця з середнім арефметичним = ", dif)

# # Число =  5
# # Різниця з середнім арефметичним =  0.5

#######################################################################################
#######################################################################################
# 2)вывести на экран пустой квадрат из "*" сторона которого указана в переменой:

# a = 12
# for i in range(a):
#     if i == 0 or i == a-1:
#         print("**********")
#     else:
#         print('*        *')

# # **********
# # *        *
# # *        *
# # *        *
# # *        *
# # *        *
# # *        *
# # *        *
# # *        *
# # *        *
# # *        *
# # **********

###########################################################
# 3) переделать первое задание под меню с помощью цикла
while True:
    print("**************************************************************")
    print("""
        Виберіть операцію:
        1) Знайти min число в лісті
        2) Видалити усі однакові значення
        3) Замінити кожне четверте значення на "Х"
        4) Елемент ліста, значення якого є найближчим до седенього арефметичного всіх елементів ліста
        5) Вийти
        """)
    try:
        x = int(input("Введіть номер дії: "))
        if x == 1:
            low = list1[0]
            for i in list1:
                if i < low:
                    low = i
            print('\nНайменше число в лісті = ', low)
            print('Ліст: ', list1)

        elif x == 2:
            list2 = []
            for i in list1:
                if i not in list2:
                    list2.append(i)
            print('\nЛіст без повторень = ', list2)

        elif x == 3:
            index = 0
            for i in list1:
                list1.pop(index)
                list1.insert(index, 'X')
                if index + 4 < len(list1) - 1:
                    index += 4
                else:
                    break
            print('\nЗмінений ліст: ', list1)
            list1 = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]

        elif x == 4:
            avg = sum(list1) / len(list1)
            dif = max(list1)
            elem = 0

            for i in list1:
                if abs(i - avg) < dif:
                    dif = abs(i - avg)
                    elem = i
            print("\nЧисло = ", elem, "\nРізниця з середнім арефметичним = ", dif)
            print('Ліст: ', list1)

        elif x == 5:
            print("\nGoodbye")
            break
        else:
            print("Неправильно введений номер")
    except ValueError:
        print("Неправильно введений номер. Потрібно ввести число від 1 до 5")
    input("\nНажміть Enter, щоб повернутись у меню")

###########################################################
# 4) вывести табличку умножения с помощью цикла while

# i = j = 1
# while i <= 9:
#     print(f'{i:10}', end=' ')
#     while j <= 8:
#         j += 1
#         print(f'{i * j:3}', end=' ')
#     i += 1
#     j = 1
#     print("")

# 1   2   3   4   5   6   7   8   9
# 2   4   6   8  10  12  14  16  18
# 3   6   9  12  15  18  21  24  27
# 4   8  12  16  20  24  28  32  36
# 5  10  15  20  25  30  35  40  45
# 6  12  18  24  30  36  42  48  54
# 7  14  21  28  35  42  49  56  63
# 8  16  24  32  40  48  56  64  72
# 9  18  27  36  45  54  63  72  81
