# strings
#
# 1)написати прогу, яка вибирає зі введеної строки цифри і виводить їх через кому,
# наприклад:
# st = 'as 23 fdfdg544' введена строка
# 2,3,5,4,4        #вивело в консолі.

# st = input('Ведіть текст із буквами за цифрами: ')
#
# l = []
# for i in st:
#     if i.isdigit():
#         l.append(int(i))
# print(str(l)[1:-1])



# #################################################################################
# 2)написати прогу, яка вибирає зі введеної строки числа і виводить їх
# так як вони написані
# наприклад:
# st = 'as 23 fdfdg544 34'  # введена строка
#   23, 544, 34              #вивело в консолі

# st = input('Ведіть текст із буквами за цифрами: ')
# numb = []
# i = 0
# while i < len(st):
#     s_int = ''
#     a = st[i]
#     while a.isdigit():
#         s_int += a
#         i += 1
#         if i < len(st):
#             a = st[i]
#         else:
#             break
#     i += 1
#     if s_int != '':
#         numb.append(int(s_int))
#
# print(str(numb)[1:-1])


# #################################################################################
# #################################################################################
# #################################################################################
#
# list comprehension
#
# 1)есть строка:
# greeting = 'Hello, world'
# записать каждый символ в лист поменяв его на верхний регистр
# пример:
# ['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']

# newList = [i.upper() for i in greeting]
# print(newList)


# #################################################################################
# 2) с диапазона от 0-50 записать в лист только не парные числа, при этом возвести их в квадрат
# пример:
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]

# newList = [i ** 2 for i in range(51) if i % 2 != 0]
# print(newList)


# [1, 9, 25, 49, 81, 121, 169, 225, 289, 361, 441, 529, 625, 729, 841, 961, 1089, 1225, 1369, 1521, 1681, 1849, 2025, 2209, 2401]


# #################################################################################
# function
#
# - створити функцію яка виводить ліст

# newList = [i ** 2 for i in range(51) if i % 2 != 0]
#
#
# def print_def(l):
#     print(l)
#
#
# print_def(newList)

# ==============================================
# - створити функцію яка приймає три числа та виводить та повертає найменьше.

# def min_number(n1, n2, n3):
#     return min(n1, n2, n3)
#
#
# print(min_number(1, 3, 5))

# def min_number(*args):
#     return min(args)
#
#
# print(min_number(1, -3, 5))


# ==============================================
# - створити функцію яка приймає три числа та виводить та повертає найбільше.
# def min_number(n1, n2, n3):
#     return max(n1, n2, n3)
#
#
# print(min_number(1, 20, 5))


# ==============================================
# - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше

# def number(*args):
#     print(f"max = {max(args)}")
#     return f"min = {min(args)}"
#
#
# print(number(1, 2, 8, 9, 6))

# ==============================================
# - створити функцію яка повертає найбільше число з ліста
# l = [1, 8, 6, -1, 22, 7, 2]
#
#
# def max_list(l):
#     return f'max = {max(l)}'
#
#
# print(max_list(l))

# ==============================================
# - створити функцію яка повертає найменьше число з ліста

# l = [1, 8, 6, -1, 22, 7, 2]
#
#
# def min_list(l):
#     return f'min = {min(l)}'
#
#
# print(min_list(l))


# ==============================================
# - створити функцію, яка приймає ліст чисел та складає значення елементів ліста та повертає його.

# number_l = [1, 8, 6, -1, 22, 7, 2]
#
#
# def sum_of_list(number_list):
#     res = 0
#     for i in number_list:
#         res += i
#     return res
#
#
# print(sum_of_list(number_l))

# ==============================================
# - створити функцію, яка приймає ліст чисел та повертає середнє арифметичне його значень.
# number_l = [1, 8, 6, -1, 22, 7, 2]
#
#
# def avg_list(l):
#     return sum(l) / len(l)
#
#
# print(f"Avg of list: {avg_list(number_l):.2f}")

# ==============================================
# decorators
# - є функція:
# def pr():
#     return 'Hello_boss_!!!'
#  написати декоратор до цієї функції, який замінює нижні підчеркування на пробіли і повертає це значення

# def underscore_to_space(func):
#     def wrapper(*args, **kwargs):
#         return_of_func = func(*args, **kwargs)
#         replace = return_of_func.replace('_', ' ')
#         return replace
#
#     return wrapper
#
#
# @underscore_to_space
# def pr():
#     return 'Hello_boss_!!!'
#
#
# print(pr())


# ======================================================================================================================
# ======================================================================================================================
# ======================================================================================================================

# = = = = = = = = =  Практическая  = = = = = = = = =


# прога, що виводить кількість кожного символа з введеної строки,
# наприклад:
# st = 'as 23 fdfdg544' #введена строка

# st = 'as 23 fdfdg544'
# 'a' -> 1  #вивело в консолі
# 's' -> 1
# ' ' -> 2
# '2' -> 1
# '3' -> 1
# 'f' -> 2
# 'd' -> 2
# 'g' -> 1
# '5' -> 1
# '4' -> 2
# """

# st = input('Введіть текст: ')
# d = dict()
#
# for i in st:
#     if d.get(i) is None:
#         d[i] = 1
#     else:
#         d[i] += 1
#
# for k, v in d.items():
#     print(f'\'{k}\' => {v}')

# =============================================
# list comprehension
#
# 1)  есть лист:
# numbers = [1, 2, 3, 4, 5, 6, 7, 8]
# создать новый лист и записать в него 'GT' если элемент в numbers больше 4 и 'LT' если элемент меньше или равен 4
# пример:
# ['LT', 'LT', 'LT', 'LT', 'GT', 'GT', 'GT', 'GT']
# numbers = [1, 2, 3, 4, 5, 6, 7, 8]

# newList = [str(i).replace(str(i), 'LT') if i <= 4
#            else str(i).replace(str(i), 'GT')
#            for i in numbers]
# print(newList)


# =============================================
# 2) есть два листа:
# list1 = [1, 2, 3, 4, 5]
# list2 = [-1, 7, 10, -5, -2]
#
# записать в лист тюплы (x,y) если x+y == 0
# пример:
# [(1, -1), (2, -2), (5, -5)]

# list3 = [(i, j) for i in list1 for j in list2 if i + j == 0]
# print(list3)
